mydata/posts/about-me/2012-01-29-wls-work.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>---</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="---"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-20 15:00:21 EDT"/>
<meta name="author" content="Neil Smithline"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">---</h1>


title:             "WLS Work"
description:       ""
date:              "2012-01-29 Sun 16:01:13"
layout:            post
comments:          true
published:         false
---


<ul>
<li>1/7/2012
<ul>
<li>weblogic.security.spi: <a href="http://docs.oracle.com/cd/E24329_01/apirefs.1211/e24391/weblogic/security/spi/package-summary.html">http://docs.oracle.com/cd/E24329_01/apirefs.1211/e24391/weblogic/security/spi/package-summary.html</a>
    Note the "V2" classes.
</li>
<li>WLS Overview: <a href="http://www.oracle.com/technetwork/middleware/weblogic/overview/index.html">http://www.oracle.com/technetwork/middleware/weblogic/overview/index.html</a> 
</li>
<li>Backwards compatibility: <a href="http://docs.oracle.com/cd/E24329_01/apirefs.1211/e24391/weblogic/security/package-summary.html">http://docs.oracle.com/cd/E24329_01/apirefs.1211/e24391/weblogic/security/package-summary.html</a>
</li>
<li>Common Criteria Evaluations: <a href="http://www.oracle.com/technetwork/topics/security/oracle-cc-evalweblogic-083241.html">http://www.oracle.com/technetwork/topics/security/oracle-cc-evalweblogic-083241.html</a>
</li>
<li>Believe prolific throughout Oracle Fusion Middleware (<a href="http://www.oracle.com/technetwork/middleware/fusion-middleware/overview/index.html">http://www.oracle.com/technetwork/middleware/fusion-middleware/overview/index.html</a>)
</li>
<li>Products: SOA Suite, WebCenter Portal and maybe other WebCenter products, WLS, App Server, BPEL, PBM, Portal, WebLogic Integration, WebLogic Portal,  
</li>
</ul>

</li>
</ul>


<p>
<a href="http://docs.oracle.com/cd/E21764_01/web.1111/b32511/intro_ws.htm#autoId0">http://docs.oracle.com/cd/E21764_01/web.1111/b32511/intro_ws.htm#autoId0</a>
Web Services Security and Administration in Oracle Fusion Middleware 11g
</p>
<p>
The following highlights the main features of Oracle Fusion Middleware 11g Release 1 (11.1.1):
</p>
<p>
    Oracle Web Services Manager (WSM) security and management has been completely redesigned and rearchitected. The previous release, Oracle WSM 10g, was delivered as a standalone product or as a component of the Oracle SOA Suite. In the 11g release, Oracle WSM has been integrated into the Oracle WebLogic Server. For complete details, see "Examining the Rearchitecture of Oracle WSM in Oracle Fusion Middleware".
</p></div>

</body>
</html>
